
namespace Domain.OrdersAggregate.Services;
//سرویس که داخل دامین ساخته میشه
//داخل هر اگریگیت ساخته میشه
//مثلا در دامین سفارشات میخاهیم ببینیم ایا اون محصول وجود داره
// در این حالت دامین سرویس میسازیم ومیریم ببینیم آیا اون محصول وجود داره یا نه
//زمانی که به دیتابیس نیازداریم
// پیاده سازیش هم در لایه اپلیکیشن هست واز ریپوزیتاری استفاده میکنه همونی که تو دامین تعریف و در اینفراستراکچر استفاده کردیم
//اگر کسب وکار ما نیاز به سرویس هایی داره که باید از اگریگیت های دیگه بخاد استفاده کنه باید از دامین سرویس استفاده کنیم.
public interface IOrderDomainService
{
    bool IsProductNotExist(Guid productId);
}
